asanza/LwIPFreeRTOS/LwIP/port/stm32x_ethernetif.c
/**
 * <b>File:</b> stm32x_ethernetif.c
 *
 * <b>Project:</b> STM32x Eclipse demo
 *
 * <b>Description:</b> This module is used to implement a network interface bridge between
 *                     the STM32x MAC peripheral and lwIP stack.
 *
 *
 * <b>Created:</b> 27/06/2009
 *
 * <dl>
 * <dt><b>Author</b>:</dt>
 * <dd>Stefano Oliveri</dd>
 * <dt><b>E-mail:</b></dt>
 * <dd>software@stf12.net</dd>
 * </dl>
 */

/*
 * This file is a skeleton for developing Ethernet network interface
 * drivers for lwIP. Add code to the low_level functions and do a
 * search-and-replace for the word "ethernetif" to replace it with
 * something that better describes your network interface.
 */

#include "lwip/def.h"
#include "lwip/mem.h"
#include "lwip/pbuf.h"
#include "lwip/sys.h"
#include <lwip/stats.h>
#include <lwip/snmp.h>
#include <netif/etharp.h>

// ST Library include
#include "stm32f10x.h"
#include "misc.h"
#include <stm32_eth.h>
#include <stm32f10x_gpio.h>
#include <stm32f10x_rcc.h>

// FreeRTOS include
#include "FreeRTOS.h"
#include "semphr.h"
#include "task.h"

// Standard library include
#include <stdio.h>
#include <string.h>

#define netifMTU								( 1500 )
#define netifINTERFACE_TASK_STACK_SIZE			( 1500 )
#define netifINTERFACE_TASK_PRIORITY			( configMAX_PRIORITIES - 6 )
#define IFNAME0 'e'
#define IFNAME1 'n'
#define netifINIT_WAIT							( 100 / portTICK_RATE_MS )

/* The time to block waiting for input. */
#define emacBLOCK_TIME_WAITING_FOR_INPUT		( ( portTickType ) 100 )


/* Hardware specifics. */
#define RCC_MAC_CLOCK							( 1UL << 14UL )
#define RCC_MAC_TX_CLOCK						( 1UL << 15UL )
#define RCC_MAC_RX_CLOCK						( 1UL << 16UL )
#define PHY_ADDRESS								( 1 )
#define MODE_MII								( 1UL << 23UL )
#define REMAP_MAC_IO							( 1UL << 21UL )

/* The number of descriptors to chain together for use by the Rx DMA. */
#define NUM_RX_DESCRIPTORS						4

/* The total number of buffers to be available.  At most (?) there should be
 one available for each Rx descriptor, one for current use, and one that is
 in the process of being transmitted. */
#define NUM_BUFFERS								( NUM_RX_DESCRIPTORS + 2 )

/* Each buffer is sized to fit an entire Ethernet packet.  This is for
 simplicity and speed, but could waste RAM. */
#define MAX_PACKET_SIZE							1520

/* The field in the descriptor that is unused by this configuration is used to
 hold the send count.  This is just #defined to a meaningful name. */
#define SendCount Buffer2NextDescAddr

/* If no buffers are available, then wait this long before looking again.... */
#define netifBUFFER_WAIT_DELAY					( 100 / portTICK_RATE_MS )
/* ...and don't look more than this many times. */
#define netifBUFFER_WAIT_ATTEMPTS				( 9 )
/* Let the DMA know that a new descriptor has been made available to it. */
#define prvRxDescriptorAvailable()				ETH->DMARPDR = 0

/* Allocate the Rx descriptors used by the DMA. */
static ETH_DMADESCTypeDef xRxDescriptors[NUM_RX_DESCRIPTORS] __attribute__((aligned(4)));

/* Allocate the descriptor used for transmitting.  It might be that better
 performance could be achieved by having more than one Tx descriptor, but
 in this simple case only one is used. */
static volatile ETH_DMADESCTypeDef xTxDescriptor __attribute__((aligned(4)));

/* Buffers used for receiving and transmitting data. */
static unsigned char ucMACBuffers[NUM_BUFFERS][MAX_PACKET_SIZE] __attribute__((aligned(4)));

/* Each ucBufferInUse index corresponds to a position in the same index in the
 ucMACBuffers array.  If the index contains a 1 then the buffer within
 ucMACBuffers is in use, if it contains a 0 then the buffer is free. */
static unsigned char ucBufferInUse[NUM_BUFFERS] = { 0 };

/* Index to the Rx descriptor to inspect next when looking for a received
 packet. */
static unsigned long s_ulNextDescriptor;

/* The lwip_buffer for Rx packet is not a fixed array, but instead gets pointed to the buffers
 allocated within this file. */
static unsigned char * s_lwip_in_buf;

/* The lwip_buffer for Tx packet is not a fixed array, but instead gets pointed to the buffers
 allocated within this file. */
static unsigned char * s_lwip_out_buf;

/* Flag to indicate transmit machine is ready to fire off an outgoing packet */
static char s_tx_ready;

/* The semaphore used by the ISR to wake the lwIP task. */
static xSemaphoreHandle s_xSemaphore = NULL;

struct ethernetif {
	struct eth_addr *ethaddr;
/* Add whatever per-interface state that is needed here. */
};

/* Forward declarations. */
static void ethernetif_input(void *pParams);

/**
 * Configure the IO for Ethernet use.
 */
static void prvSetupEthGPIO(void);

/**
 * Return a pointer to an unused buffer, marking the returned buffer as now
 * in use.
 */
static unsigned char *prvGetNextBuffer(void);

/**
 * Send usDataLen bytes from s_lwip_buf to the MAC for transmission.
 */
unsigned char vSendMACData(unsigned short usDataLen);

/**
 * Look for new received data.  If any is found then set s_lwip_buf to point to the
 * data and return the length of the data.  If no data is found then 0 is
 * returned, and s_lwip_buf is left pointing to a spare data buffer.
 */
unsigned short usGetMACRxData(void);

/**
 * Initialize all IO and peripherals required for Ethernet communication.
 *
 * @return pdSUCCESS if success, pdFAIL to signal some error.
 */
portBASE_TYPE xEthInitialise(void);

/**
 * Return a buffer to the pool of free buffers.
 */
void vReturnBuffer(unsigned char *pucBuffer);


/**
 * In this function, the hardware should be initialized.
 * Called from ethernetif_init().
 *
 * @param netif the already initialized lwip network interface structure
 *        for this ethernetif
 */
static void low_level_init(struct netif *netif) {
	/* set MAC hardware address length */
	netif->hwaddr_len = ETHARP_HWADDR_LEN;

	/* set MAC hardware address */
	netif->hwaddr[0] = configMAC_ADDR0;
	netif->hwaddr[1] = configMAC_ADDR1;
	netif->hwaddr[2] = configMAC_ADDR2;
	netif->hwaddr[3] = configMAC_ADDR3;
	netif->hwaddr[4] = configMAC_ADDR4;
	netif->hwaddr[5] = configMAC_ADDR5;

	/* maximum transfer unit */
	netif->mtu = netifMTU;

	// device capabilities.
	// don't set NETIF_FLAG_ETHARP if this device is not an ethernet one
	//TODO: LINK_UP is extra here.... maybe!
	netif->flags |= NETIF_FLAG_BROADCAST | NETIF_FLAG_ETHARP| NETIF_FLAG_LINK_UP;

	/* Do whatever else is needed to initialize interface. */

