asanza/LwIPFreeRTOS/LwIP/port/stm32x_ethernetif.c
	/* ETHERNET pins configuration */
	/* AF Output Push Pull:
	- ETH_MII_MDIO / ETH_RMII_MDIO: PA2
	- ETH_MII_MDC / ETH_RMII_MDC: PC1
	- ETH_MII_TXD2: PC2
	- ETH_MII_TX_EN / ETH_RMII_TX_EN: PB11
	- ETH_MII_TXD0 / ETH_RMII_TXD0: PB12
	- ETH_MII_TXD1 / ETH_RMII_TXD1: PB13
	- ETH_MII_PPS_OUT / ETH_RMII_PPS_OUT: PB5
	- ETH_MII_TXD3: PB8 */

	/* Configure PA2 as alternate function push-pull */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	/* Configure PC1, PC2 and PC3 as alternate function push-pull */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_Init(GPIOC, &GPIO_InitStructure);

	/* Configure PB5, PB8, PB11, PB12 and PB13 as alternate function push-pull */
	GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_11 |
	GPIO_Pin_12 | GPIO_Pin_13;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_Init(GPIOB, &GPIO_InitStructure);

	/**************************************************************/
	/*               For Remapped Ethernet pins                   */
	/*************************************************************/
	/* Input (Reset Value):
	- ETH_MII_CRS CRS: PA0
	- ETH_MII_RX_CLK / ETH_RMII_REF_CLK: PA1
	- ETH_MII_COL: PA3
	- ETH_MII_RX_DV / ETH_RMII_CRS_DV: PD8
	- ETH_MII_TX_CLK: PC3
	- ETH_MII_RXD0 / ETH_RMII_RXD0: PD9
	- ETH_MII_RXD1 / ETH_RMII_RXD1: PD10
	- ETH_MII_RXD2: PD11
	- ETH_MII_RXD3: PD12
	- ETH_MII_RX_ER: PB10 */

	/* ETHERNET pins remapp in STM3210C-EVAL board: RX_DV and RxD[3:0] */
	GPIO_PinRemapConfig(GPIO_Remap_ETH, DISABLE);

	/* Configure PA0, PA1 and PA3 as input */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_7 ;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	/* Configure PB10 as input */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_Init(GPIOB, &GPIO_InitStructure);

	/* Configure PC3 as input */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_Init(GPIOC, &GPIO_InitStructure);

	/* Configure PD8, PD9, PD10, PD11 and PD12 as input */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4 | GPIO_Pin_5;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_Init(GPIOC, &GPIO_InitStructure); /**/

	/* MCO pin configuration------------------------------------------------- */
	/* Configure MCO (PA8) as alternate function push-pull */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
}

static unsigned char *prvGetNextBuffer(void) {
	portBASE_TYPE x;
	unsigned char *ucReturn = NULL;

	while (ucReturn == NULL) {
		/* Look through the buffers to find one that is not in use by
		 anything else. */
		vTaskSuspendAll();
		for (x = 0; x < NUM_BUFFERS; x++) {
			if (ucBufferInUse[x] == pdFALSE) {
				ucBufferInUse[x] = pdTRUE;
				ucReturn = &(ucMACBuffers[x][0]);
				break;
			}
		}
		xTaskResumeAll();

		/* Was a buffer found? */
		if (ucReturn == NULL) {
			/* Wait then look again. */
			vTaskDelay(netifBUFFER_WAIT_DELAY);
		}
	}
	return ucReturn;
}

void vMAC_ISR(void) {
	unsigned long ulStatus;
	long xHigherPriorityTaskWoken = pdFALSE;

	/* What caused the interrupt? */
	ulStatus = ETH->DMASR;

	/* Clear everything before leaving. */
	ETH->DMASR = ulStatus;

	if (ulStatus & ETH_DMA_IT_R) {
		/* Data was received.  Ensure the uIP task is not blocked as data has
		 arrived. */
		xSemaphoreGiveFromISR( s_xSemaphore, &xHigherPriorityTaskWoken );
	}

	if (ulStatus & ETH_DMA_IT_T) {
		/* Data was transmitted, ready to transmit again */
		s_tx_ready = 1;
		/* The Tx buffer is no longer required. */
		vReturnBuffer((unsigned char *) xTxDescriptor.Buffer1Addr);
	}

	/* If xSemaphoreGiveFromISR() unblocked a task, and the unblocked task has
	 a higher priority than the currently executing task, then
	 xHigherPriorityTaskWoken will have been set to pdTRUE and this ISR should
	 return directly to the higher priority unblocked task. */
	portEND_SWITCHING_ISR( xHigherPriorityTaskWoken );
}

void ETH_IRQHandler()
{
	vMAC_ISR();
}

void DMA2_Channel5_IRQHandler()
{
	vMAC_ISR();
}


void vReturnBuffer(unsigned char *pucBuffer) {
	unsigned long ul;

	/* Mark a buffer as free for use. */
	for (ul = 0; ul < NUM_BUFFERS; ul++) {
		if (ucMACBuffers[ul] == pucBuffer) {
			ucBufferInUse[ul] = pdFALSE;
			break;
		}
	}
}

unsigned char vSendMACData(unsigned short usDataLen) {
	unsigned long ulAttempts = 0UL;
	unsigned char res = 1;

	/* Check to see if the Tx descriptor is free. */
	while (!s_tx_ready || (xTxDescriptor.Status & ETH_DMATxDesc_OWN) == ETH_DMATxDesc_OWN) {
		/* Wait for the Tx descriptor to become available. */
		vTaskDelay(netifBUFFER_WAIT_DELAY);

		ulAttempts++;
		if (ulAttempts > netifBUFFER_WAIT_ATTEMPTS) {
			/* Something has gone wrong as the Tx descriptor is still in use.
			 Clear it down manually, the data it was sending will probably be
			 lost. */
			xTxDescriptor.Status &= ~ETH_DMATxDesc_OWN;
			vReturnBuffer((unsigned char *) xTxDescriptor.Buffer1Addr);
			res = 0;
			break;
		}
	}

	/* Setup the Tx descriptor for transmission. */
	s_tx_ready = 0;
	xTxDescriptor.Buffer1Addr = (unsigned long) s_lwip_out_buf;
	xTxDescriptor.ControlBufferSize = (unsigned long) usDataLen;
	xTxDescriptor.Status = ETH_DMATxDesc_OWN | ETH_DMATxDesc_LS
			| ETH_DMATxDesc_FS | ETH_DMATxDesc_TER | ETH_DMATxDesc_TCH
			| ETH_DMATxDesc_IC;
	ETH->DMASR = ETH_DMASR_TBUS;
	ETH->DMATPDR = 0;

