asanza/LwIPFreeRTOS/LwIP/port/stm32x_ethernetif.c
	/* s_lwip_out_buf is being sent by the Tx descriptor.  Allocate a new buffer. */
	//TODO: It causes problems under load. It  seems it is not thread safe.
	s_lwip_out_buf = prvGetNextBuffer();
	vTaskDelay(10);
	return res;
}

unsigned short usGetMACRxData(void) {
	unsigned short usReturn;

	if ((xRxDescriptors[s_ulNextDescriptor].Status & ETH_DMARxDesc_ES) != 0) {
		/* Error in Rx.  Discard the frame and give it back to the DMA. */
		xRxDescriptors[s_ulNextDescriptor].Status = ETH_DMARxDesc_OWN;
		prvRxDescriptorAvailable();

		/* No data to return. */
		usReturn = 0UL;

		/* Start from the next descriptor the next time this function is called. */
		s_ulNextDescriptor++;
		if (s_ulNextDescriptor >= NUM_RX_DESCRIPTORS) {
			s_ulNextDescriptor = 0UL;
		}
	} else if ((xRxDescriptors[s_ulNextDescriptor].Status & ETH_DMARxDesc_OWN) == 0) {
		/* Mark the current buffer as free as s_lwip_in_buf is going to be set to
		 the buffer that contains the received data. */
		if (s_lwip_in_buf)
			vReturnBuffer(s_lwip_in_buf);

		/* Get the received data length	from the top 2 bytes of the Status
		 word and the data itself. */
		usReturn = (unsigned short) ((xRxDescriptors[s_ulNextDescriptor].Status & ETH_DMARxDesc_FL) >> 16UL);
		s_lwip_in_buf = (unsigned char *) (xRxDescriptors[s_ulNextDescriptor].Buffer1Addr);

		/* Allocate a new buffer to the descriptor. */
		xRxDescriptors[s_ulNextDescriptor].Buffer1Addr = (unsigned long) prvGetNextBuffer();

		/* Give the descriptor back to the DMA. */
		xRxDescriptors[s_ulNextDescriptor].Status = ETH_DMARxDesc_OWN;
		prvRxDescriptorAvailable();

		/* Start from the next descriptor the next time this function is called. */
		s_ulNextDescriptor++;
		if (s_ulNextDescriptor >= NUM_RX_DESCRIPTORS) {
			s_ulNextDescriptor = 0UL;
		}
	} else {
		/* No received data at all. */
		usReturn = 0UL;
	}

	return usReturn;
}

